In [1]:
#SELECTION AND INFO ON UNIQUE ELEMENTS

In [2]:
#CREATE A DATAFRAME FIRST

In [3]:
import pandas as pd

In [10]:
df=pd.DataFrame({"col1":[1,2,3,4],"col2":[444,555,666,444],"col3":["abc","def","ghi","xyz"]})

In [11]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
#Selection

In [13]:
#Here we select from dataframe using criteria from multiple columns
#so basically we are combining multiple conditions using "&"

In [14]:
newdf=df[(df["col1"]>2) & (df["col2"]==444)]

In [15]:
newdf

   col1  col2 col3
3     4   444  xyz

In [16]:
#this is similar to conditional selection along with combining 
#several conditions

In [17]:
#INFO ON UNIQUE VALUES IN COLUMN

In [18]:
#unique elements of a column

In [19]:
df["col2"].unique()

array([444, 555, 666])

In [20]:
#count of unique elements of a columns

In [21]:
df["col2"].nunique()

3

In [22]:
#how many times the unique values appear in a column

In [23]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64